# 1 — красный, 2 — оранжевый, 3 — жёлтый, 4 — зелёный, 5 — голубой, 6 — синий, 7 — фиолетовый
COLORS = {1 => "красный", 2 => "оранжевый", 3 => "жёлтый", 4 => "зелёный", 5 => "голубой", 6 => "синий", 7 => "фиолетовый"}

def colors(num)
  p COLORS[num]
end

colors 4

# 1 — понедельник, 2 — вторник, 3 — среда, 4 — четверг, 5 — пятница, 6 — суббота, 7 — воскресенье
WEEK = {1 => "понедельник", 2 => "вторник", 3 => "среда", 4 => "четверг", 5 => "пятница", 6 => "суббота", 7 => "воскресенье"}

def week(num)
  p WEEK[num]
end

week 4
